/*
Створити клас Тварина. Описати його такими полями: назва тварини , швидкість тварини, вік тварини. Дані поля помічені модифікатором доступу private.
Створити конструктор з визначеними параметрами, в який необхідно ввести всі поля класу. Створити getters/setters до всіх полів класу. В методі мейн створити екземпляр даного класу, за допомогою getter вивести на консоль в один рядок значення полів даного класу. Викликати setter, змінити значення всіх полів класу. Вивести на консоль всі поля класу, знову в один рядок. Значення полів довільні на Ваш розсуд. В методі мейн повинен бути створений лише один об`єкт класу Тварина. Вивід повинен бути написаний наступним чином:
"Назва тварини = Леопард, Швидкість тварини = 20 км/год, Вік тварини = 7 років "
"-------------------------------------------------"
"Назва тварини = Бик, Швидкість тварини = 2 км/год, Вік тварини = 14 років "
 */
package task_3;

public class Main {
    public static void main(String[] args){
        //створюємо екземпляр класу Animal
        Animal x = new Animal("Leopard", 25, 9);

        //за допомогою методу get виводжу інформацію про перший екземпляр класу
        System.out.println("Name of animal = "+ x.getName() + "\nSpeed of animal = " + x.getSpeed() + "km/hour" +"\nAge of animal = " + x.getVik());
        System.out.println("--------------------");

        //за допомогою методу set змінюю значення всіх полів
        x.setName("Bull");
        x.setSpeed(15);
        x.setVik(8);

        //за допомогою методу get виводжу нову інформацію про перший екземпляр класу
        System.out.println("Name of animal = "+ x.getName() + "\nSpeed of animal = " + x.getSpeed() + "km/hour" +"\nAge of animal = " + x.getVik());
    }
}
