/*
Створити interface Зарплата, в якому передбачити метод зарплата().
Створити клас Працівник з погодинною зарплатою, та Працівник з фіксованою місячною зарплатою .
Реалізувати методи інтерфейсу в класах.
Працівник з погодинною зарплатою, та Працівник з фіксованою місячною зарплатою .
Формула розрахунку зарплати працівника є довільною.
Вивести на екран скільки заробляють перший і другий працівники.
 */
package task1;

public class Main {
    public static void main(String[] args) {

        //оголошуємо змінну класу Worker1
        //фіксована зарплата 19000 одиниць
        Worker1 person1 = new Worker1(19000);

        //оголошуємо змінну класу Worker2
        //щогодинна зарплата 150 од./год та тривалість відпрацьованого часу 160 год
        Worker2 person2 = new Worker2(150, 160);

        //виводимо інформацію про заробітні плати працівників

        System.out.print("Працівник із фіксованою заробітньою платою: ");
        person1.salary();
        System.out.print("Працівник із погодинною заробітньою платою: ");
        person2.salary();
    }
}
