/*
Створити двовимірний масив, який буде мати 5 рядків і 7 стовпців і заповнити його рандомними (Math.random()) цифрами з проміжку [-2;75]. Вивести масив на екран.
 */
package task_3;

public class Main {
    public static void main(String[] args) {
        //оголошуємо двовимірний масив
        int[][] array = new int[5][7];

        //заповнюємо масив випадковими числами з проміжку [-2;75]
        for(int i=1;i<5;i++){
            //проходимось по стовпцях в межах одного рядка
            for(int k=0;k<7;k++){
                array[i][k] = -2 + (int)(Math.random()*76);
            }
        }

        //виводимо двовимірний масив на екран
        for(int i=1;i<5;i++){
            //проходимось по стовпцях в межах одного рядка
            for(int k=0;k<7;k++){
                System.out.print("["+i+"]["+k+"]="+array[i][k]+"     ");
            }
            //преходимо на наступний рядок
            System.out.println();
        }
    }
}
